coocox/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
//*****************************************************************************
//
//! \file xsysctl.c
//! \brief Driver for the system controller
//! \version V2.2.1.0
//! \date 11/20/2011
//! \author CooCox
//! \copy
//!
//! Copyright (c)  2011, CooCox 
//! All rights reserved.
//! 
//! Redistribution and use in source and binary forms, with or without 
//! modification, are permitted provided that the following conditions 
//! are met: 
//! 
//!     * Redistributions of source code must retain the above copyright 
//! notice, this list of conditions and the following disclaimer. 
//!     * Redistributions in binary form must reproduce the above copyright
//! notice, this list of conditions and the following disclaimer in the
//! documentation and/or other materials provided with the distribution. 
//!     * Neither the name of the <ORGANIZATION> nor the names of its 
//! contributors may be used to endorse or promote products derived 
//! from this software without specific prior written permission. 
//! 
//! THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
//! AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
//! IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
//! ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE 
//! LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
//! CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
//! SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
//! INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
//! CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
//! ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF 
//! THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************
#include "xhw_types.h"
#include "xhw_ints.h"
#include "xhw_memmap.h"
#include "xhw_config.h"
#include "xhw_nvic.h"
#include "xhw_sysctl.h"
#include "xdebug.h"
#include "xsysctl.h"
#include "xcore.h"

static unsigned long s_ulExtClockMHz = xHSE_VAL;

//*****************************************************************************
//
// This macro extracts the array index out of the peripheral number.
//
//*****************************************************************************
#define SYSCTL_PERIPH_INDEX(a)  (((a) >> 28) & 0xf)

//*****************************************************************************
//
// This macro constructs the peripheral bit mask from the peripheral number.
//
//*****************************************************************************
#define SYSCTL_PERIPH_MASK(a)   (((a) & 0xffff) << (((a) & 0x001f0000) >> 16))

//*****************************************************************************
//
// This macro extracts the array index out of the peripheral clock source.
//
//*****************************************************************************
#define SYSCTL_PERIPH_INDEX_CLK(a)                                            \
                                (((a) >> 28) & 0xf)

//*****************************************************************************
//
// This macro constructs the peripheral bit mask from the peripheral clock source.
//
//*****************************************************************************
#define SYSCTL_PERIPH_ENUM_CLK(a)                                             \
                                (((a) & 0xff) << (((a) & 0x1f0000) >> 16))

//*****************************************************************************
//
// An array that maps the "peripheral set" number (which is stored in the upper
// nibble of the SYSCTL_PERIPH_* defines) to the GCR_IPRSTC? register that
// controls the software reset for that peripheral.
//
//*****************************************************************************
static const unsigned long g_pulIPRSTRegs[] =
{
    RCC_AHBRSTR,
    RCC_APB2RSTR,
    RCC_APB1RSTR
};

//*****************************************************************************
//
// An array that maps the "peripheral set" number (which is stored in the upper
// nibble of the SYSCTL_PERIPH_* defines) to the SYSCLK_AHBCLK register that
// controls the run-mode enable for that peripheral.
//
//*****************************************************************************
static const unsigned long g_pulAXBCLKRegs[] =
{
    RCC_AHBENR,
    RCC_APB2ENR,
    RCC_APB1ENR,
    RCC_BDCR
};

//*****************************************************************************
//
// An array that maps the "peripheral clock source set" number (which is stored
// in the upper nibble of the SYSCTL_PERIPH_* defines) to the SYSCLK_? 
// register that set the Clock source for that peripheral.
//
//*****************************************************************************
static const unsigned long g_pulCLKSELRegs[] =
{
    RCC_CFGR,
    RCC_BDCR,
    RCC_CFGR2
};

static volatile const unsigned char g_APBAHBPrescTable[16] = 
       {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};

static volatile const unsigned char g_ADCPrescTable[4] = {2, 4, 6, 8};

static const unsigned char g_AHBPrescTable[9] = 
{
    15,
    14,
    13,
    12,
    0,
    11,
    10,
    9,
    8,
};
//*****************************************************************************
//
//! Peripheral Base and ID Table structure type
//
//*****************************************************************************
typedef struct 
{
    unsigned long ulPeripheralBase;
    unsigned long ulPeripheralID;
    unsigned long ulPeripheralIntNum;
}
tPeripheralTable;

//*****************************************************************************
//
// An array is RCC Callback function point
//
//*****************************************************************************
static xtEventCallback g_pfnRCCHandlerCallbacks[1]={0};

//*****************************************************************************
//
// An array that maps the peripheral base and peripheral ID and interrupt number
// together to enablea peripheral or peripheral interrupt by a peripheral base.
//
//*****************************************************************************
static const tPeripheralTable g_pPeripherals[] =
{
    {ADC1_BASE,        xSYSCTL_PERIPH_ADC1,    xINT_ADC0},
    {ADC2_BASE,        xSYSCTL_PERIPH_ADC2,    xINT_ADC0},
    {DMA1_BASE,        xSYSCTL_PERIPH_DMA1,    xINT_DMA1},
    {DMA2_BASE,        xSYSCTL_PERIPH_DMA2,    xINT_DMA1},
    {GPIOA_BASE,       xSYSCTL_PERIPH_GPIOA,   xINT_GPIOA},
    {GPIOB_BASE,       xSYSCTL_PERIPH_GPIOB,   xINT_GPIOA},
    {GPIOC_BASE,       xSYSCTL_PERIPH_GPIOC,   xINT_GPIOA},
    {GPIOD_BASE,       xSYSCTL_PERIPH_GPIOD,   xINT_GPIOA},
    {GPIOE_BASE,       xSYSCTL_PERIPH_GPIOE,   xINT_GPIOA},
    {GPIOF_BASE,       xSYSCTL_PERIPH_GPIOF,   xINT_GPIOA},
    {GPIOG_BASE,       xSYSCTL_PERIPH_GPIOG,   xINT_GPIOA},
    {I2C1_BASE,        xSYSCTL_PERIPH_I2C1,    xINT_I2C1},
    {I2C2_BASE,        xSYSCTL_PERIPH_I2C2,    xINT_I2C2},
    {RTC_BASE,         xSYSCTL_PERIPH_RTC,     xINT_RTC},
    {SPI1_BASE,        xSYSCTL_PERIPH_SPI1,    xINT_SPI1},
    {SPI2_BASE,        xSYSCTL_PERIPH_SPI2,    xINT_SPI2},
    {SPI3_BASE,        xSYSCTL_PERIPH_SPI3,    xINT_SPI3},
    {TIM1_BASE,        xSYSCTL_PERIPH_TIMER1,  xINT_TIMER1},
    {TIM2_BASE,        xSYSCTL_PERIPH_TIMER2,  xINT_TIMER2},
    {TIM3_BASE,        xSYSCTL_PERIPH_TIMER3,  xINT_TIMER3},
    {TIM4_BASE,        xSYSCTL_PERIPH_TIMER4,  xINT_TIMER4},
    {TIM5_BASE,        xSYSCTL_PERIPH_TIMER5,  xINT_TIMER5},
    {TIM6_BASE,        xSYSCTL_PERIPH_TIMER6,  xINT_TIMER6},
    {TIM7_BASE,        xSYSCTL_PERIPH_TIMER7,  xINT_TIMER7},
    {TIM8_BASE,        xSYSCTL_PERIPH_TIMER8,  0},
    {TIM9_BASE,        xSYSCTL_PERIPH_TIMER9,  0},
    {TIM10_BASE,       xSYSCTL_PERIPH_TIMER10, 0},
    {TIM11_BASE,       xSYSCTL_PERIPH_TIMER11, 0},
    {TIM12_BASE,       xSYSCTL_PERIPH_TIMER12, 0},
    {TIM13_BASE,       xSYSCTL_PERIPH_TIMER13, 0},
    {TIM14_BASE,       xSYSCTL_PERIPH_TIMER14, 0},
    {USART1_BASE,      xSYSCTL_PERIPH_UART1,   xINT_UART1},
    {USART2_BASE,      xSYSCTL_PERIPH_UART2,   xINT_UART2},
    {USART3_BASE,      xSYSCTL_PERIPH_UART3,   xINT_UART3},
    {USART4_BASE,      xSYSCTL_PERIPH_UART4,   xINT_UART4},
    {USART5_BASE,      xSYSCTL_PERIPH_UART5,   xINT_UART5},
    {WWDG_BASE,        xSYSCTL_PERIPH_WDOG,    xINT_WDT},
};

//*****************************************************************************
//
//! \brief RCC global IRQ, declared in start up code. 
//!
//! \param None.
//!
//! This function is to give a RCC global IRQ service.
//!
//! \return None.
//
//*****************************************************************************
void 
RCCIntHandler(void)
{
    unsigned long ulStatus;

    //
    // Clear the RCC INT Flag
    //
    ulStatus = xHWREG(RCC_CIR);

