coocox/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
}

//*****************************************************************************
//
//! \brief Resets the device.
//!
//! This function will perform a software reset of the entire device.  The
//! processor and all peripherals will be reset and all device registers will
//! return to their default values (with the exception of the reset cause
//! register, which will maintain its current value but have the software reset
//! bit set as well).
//!
//! \return This function does not return.
//
//*****************************************************************************
void
SysCtlReset(void)
{
    //
    // Perform a software reset request.  This will cause the device to reset,
    // no further code will be executed.
    //
    xHWREG(NVIC_APINT) = NVIC_APINT_VECTKEY | NVIC_APINT_SYSRESETREQ;

    //
    // The device should have reset, so this should never be reached.  Just in
    // case, loop forever.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
//! \brief Puts the processor into sleep mode.
//!
//! This function places the processor into sleep mode; it will not return
//! until the processor returns to run mode.  The peripherals that are enabled
//! via SysCtlPeripheralSleepEnable() continue to operate and can wake up the
//! processor (if automatic clock gating is enabled with
//! SysCtlPeripheralClockGating(), otherwise all peripherals continue to
//! operate).
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlSleep(void)
{
    //
    // Wait for an interrupt.
    //
    xCPUwfi();
}

//*****************************************************************************
//
//! \brief The function is used to Reset Backup domain 
//!
//! \param None.
//!
//! The function is used to Reset Backup domain 
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlBackupDomainReset(void)
{
    xHWREG(RCC_BDCR) |= RCC_BDCR_BDRST;
}

//*****************************************************************************
//
//! \brief The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \return HCLK clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlHClockGet(void)
{
    unsigned long ulTemp = 0, ulPllMull = 0, ulPllSource = 0, ulPresc = 0;
    unsigned long ulHclk;

    //
    // STM32F10X_CL
    //
#if (STM32F1xx_DEVICE == STM32F10X_CL)
    unsigned long ulPrediv1Source = 0, ulPrediv1Factor = 0, ulPrediv2Factor = 0, 
                  ulPll2Mull = 0;
#endif 

#if (STM32F1xx_DEVICE == STM32F10X_LD_VL || STM32F1xx_DEVICE == STM32F10X_MD_VL\
     || STM32F1xx_DEVICE == STM32F10X_HD_VL)
    unsigned long ulPrediv1Factor = 0;
#endif
    
    //
    // Get SYSCLK source
    //
    ulTemp = xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M;
    switch (ulTemp)
    {
        //
        // HSI used as system clock
        //
        case 0x00: 
        {
            ulHclk = (unsigned long)8000000;
            break;
        }
        //
        // HSE used as system clock
        //
        case 0x04: 
        {
            ulHclk = s_ulExtClockMHz*1000000;
            break;
        }
        //
        // PLL used as system clock
        //
        case 0x08: 
        {
            //
            // Get PLL clock source and multiplication factor
            //
            ulPllMull = xHWREG(RCC_CFGR) & RCC_CFGR_PLLMUL_M;
            ulPllSource = xHWREG(RCC_CFGR) & RCC_CFGR_PLLSRC;
                  
#if (STM32F1xx_DEVICE != STM32F10X_CL)      
            ulPllMull = ( ulPllMull >> 18) + 2;
      
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
#if (STM32F1xx_DEVICE == STM32F10X_LD_VL || STM32F1xx_DEVICE == STM32F10X_MD_VL\
     || STM32F1xx_DEVICE == STM32F10X_HD_VL)
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
                //
                // HSE oscillator clock selected as PREDIV1 clock entry 
                //
                ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull; 
#else
                //
                // HSE selected as PLL clock entry 
                //
                if ((xHWREG(RCC_CFGR) & RCC_CFGR_PLLXTPRE) != 0)
                {
                    //
                    // HSE oscillator clock divided by 2 
                    //
                    ulHclk = ((s_ulExtClockMHz*1000000) >> 1) * ulPllMull;
                }
                else
                {
                    ulHclk = s_ulExtClockMHz*1000000 * ulPllMull;
                }
#endif
            }
#else
            ulPllMull = ulPllMull >> 18;
          
            if (ulPllMull != 0x0D)
            {
                ulPllMull += 2;
            }
            else
            { 
                //
                // PLL multiplication factor = PLL input clock * 6.5 
                //
                ulPllMull = 13 / 2; 
            }
                  
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
                //
                // PREDIV1 selected as PLL clock entry 
                //
                
                //
                // Get PREDIV1 clock source and division factor
                //
                ulPrediv1Source = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1SRC);
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
              
                if (ulPrediv1Source == 0)
                { 
                    //
                    // HSE oscillator clock selected as PREDIV1 clock entry 
                    //
                    ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull;          
                }
                else
                {
                    //
                    // PLL2 clock selected as PREDIV1 clock entry 
                    //
        
                    //
                    // Get PREDIV2 division factor and PLL2 multiplication factor 
                    //
                    ulPrediv2Factor = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV2_M)
                                        >> RCC_CFGR2_PREDIV2_S) + 1;
                    ulPll2Mull = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PLL2MUL_M) >> 8 ) + 2; 
                    ulHclk = (((s_ulExtClockMHz*1000000 / ulPrediv2Factor) * 
                             ulPll2Mull) / ulPrediv1Factor) * ulPllMull;                         
                }
            }
#endif 
        break;
        }
        default: 
        {
            ulHclk = 8000000;
            break;
        }
    }
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_HPRE_M) >> RCC_CFGR_HPRE_S;
    ulPresc = g_APBAHBPrescTable[ulTemp];
    ulHclk = ulHclk >> ulPresc;
    return ulHclk;
}

//*****************************************************************************
//
//! \brief The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \return APB1 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB1ClockGet(void)
{
    unsigned long ulTemp,ulAPB1Clock;
    ulAPB1Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE1_M) >> RCC_CFGR_PPRE1_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB1Clock = ulAPB1Clock >> ulTemp;
    return ulAPB1Clock;
}

//*****************************************************************************
//
//! \brief The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \return APB2 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB2ClockGet(void)
{
    unsigned long ulTemp,ulAPB2Clock;
    ulAPB2Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE2_M) >> RCC_CFGR_PPRE2_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB2Clock = ulAPB2Clock >> ulTemp;
    return ulAPB2Clock;
}

//*****************************************************************************
//
//! \brief Enables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to enable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessEnable(void)
{
    xHWREG(PWR_CR) |= PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Disables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to disable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessDisable(void)
{
    xHWREG(PWR_CR) &= ~PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Configures the voltage threshold detected by the Power Voltage 
//! Detector(PVD).
//!
//! \param ulConfig specifies the PVD detection level configurations
//!
//! The \e ulConfig parameter is the logical OR of two different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The enable or disable PVD is chosen with one of the following values:
//! \ref SYSCTL_PVD_EN, \ref SYSCTL_PVD_DIS.
//!
//! The PVD detection level is chosen with one of the following values:
//! \ref SYSCTL_PVDLEVEL_2V2, \ref SYSCTL_PVDLEVEL_2V3 \ref SYSCTL_PVDLEVEL_2V4,
//! \ref SYSCTL_PVDLEVEL_2V5, \ref SYSCTL_PVDLEVEL_2V6, \ref SYSCTL_PVDLEVEL_2V7,
//! \ref SYSCTL_PVDLEVEL_2V8, \ref SYSCTL_PVDLEVEL_2V9.
//!
//! The function is used to configures the voltage threshold detected by the 
//! Power Voltage Detector(PVD).
//!
//! \return None 
//
//*****************************************************************************
void
SysCtlPVDLevelConfig(unsigned long ulConfig)
{
    xHWREG(PWR_CR) &= ~(PWR_CR_PVDE | PWR_CR_PLS_M);
    xHWREG(PWR_CR) |= ulConfig;
}

//*****************************************************************************
//
//! \brief Enables the WakeUp Pin functionality.
//!
//! \param None.
//!
//! The function is used to enable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlWakeUpPinEnable(void)
{
    xHWREG(PWR_CSR) |= PWR_CSR_EWUP;
}

//*****************************************************************************
//
//! \brief Disables the WakeUp Pin functionality.
//!
//! \param None.
//!
//! The function is used to disable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlWakeUpPinDisable(void)
{
    xHWREG(PWR_CSR) &= ~PWR_CSR_EWUP;
}

//*****************************************************************************
//
//! \brief Enters STOP mode.
//!
//! \param ulConfig specifies the STOP mode configurations.
//!
//! The \e ulConfig parameter is the logical OR of two different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The Voltage regulator is chosen with one of the following values:
//! \ref SYSCTL_REGULATOR_ON, \ref SYSCTL_REGULATOR_LP.
//!
//! The WFI or WFE instruction is chosen with one of the following values:
//! \ref SYSCTL_STOP_WFI, \ref SYSCTL_STOP_WFE.
//!
//! The function is used to disable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlStopModeConfig(unsigned long ulConfig)
{
    xHWREG(PWR_CR) &= ~(PWR_CR_PDDS | PWR_CR_LPDS);
    xHWREG(PWR_CR) |= (ulConfig & PWR_CR_LPDS);
    xHWREG(NVIC_SYS_CTRL) |= NVIC_SYS_CTRL_SLEEPDEEP;
    if(ulConfig & SYSCTL_STOP_WFI)
    {
        xCPUwfi();
    }
    else
    {
        xCPUwfe();
    }
}

//*****************************************************************************
//
//! \brief Enters STANDBY mode.
//!
//! \param None.
//!
//! The function is used to enters STANDBY mode.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlEnterStandbyMode(void)
{
    xHWREG(PWR_CR) |= PWR_CR_CWUF;
    xHWREG(PWR_CR) |= PWR_CR_PDDS;
    xHWREG(NVIC_SYS_CTRL) |= NVIC_SYS_CTRL_SLEEPDEEP;
    xCPUwfi();
}

//*****************************************************************************
//
//! \brief Get all the PWR flag is set or not.
//!
//! \param None.
//!
//! The function is used to check whether the specified PWR flag is set or not.
//!
//! \return Flag status 
//! Flag status can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//
//*****************************************************************************
unsigned long 
SysCtlFlagStatusGet(void)
{
    return (xHWREG(PWR_CSR) & (PWR_CSR_WUF | PWR_CSR_SBF | PWR_CSR_PVDO));
}

//*****************************************************************************
//
//! \brief Clears the PWR's pending flags.
//!
//! \param None.
//! This parameter can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//!
//! The function is used to check whether the specified PWR flag is set or not.
//!
//! \return Flag status 
//! Flag status can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//
//*****************************************************************************
void
SysCtlFlagStatusClear(unsigned long ulFlag)
{
    xHWREG(PWR_CR) |= (ulFlag & (PWR_CR_CWUF | PWR_CR_CSBF)) << 2;
}
